import { ITaleProps } from '../../types/ITaleProps.interface';

const tales: ITaleProps[] = [
	{
		preview: {
			title: 'Дракон',
			description:
				'Because the secret of all truth Is the quest for - and you`ll feel...',
			image: '/src/pics/cards/dragon.jpg',
			backImage: '/src/pics/Dragon/fields.jpg',
		},
		name: 'Dragon',
		link: '/Dragon',
		content: [
			{
				className: 'dragon_paragraph_1',
				type: 'text',
				text: 'Много-много лет назад жил на свете юноша, что любил сказки. Ютился он с остальными людьми в недрах земли, в сырости и холоде. И каждый день приходил он к старику на окраине поселения, что располагалось в глубокой пещере, и слушал его истории. Слушал он о ратных воинах, что одним взмахом могучего меча побеждали драконов, о волшебниках и их чудесах. И в один день после очередной истории спросил он старика: "Ответь мне, дедушка, каждый вечер рассказываешь ты истории свои, но где же я могу стать их частью? Где могу я найти дракона с неотрубленной головой?", на что старик лишь засмеялся и ничего не ответил юноше.',
				image: '',
				options: {
					appearanceDirection: 'left',
					position: 'left',
				},
			},
			{
				className: 'underground_city',
				type: 'image',
				text: '',
				image: '/src/pics/Dragon/underground_city.jpg',
				options: {
					appearanceDirection: 'bottom',
					position: 'center',
				},
			},
			{
				className: 'dragon_paragraph_2',
				type: 'text',
				text: 'На следующий день, собрав все то немногое, что он имел, мальчик отправился в путь. Он ходил по самым мрачным закоулкам подземелья, в котором вырос, залезал в недра катакомб, некогда обитаемых сказочными тварями, но везде находил лишь руины, кости и прах, свидетельствующие о присутствии чего-то великого и невероятно древнего в этих местах, что ныне всеми забыто.',
				image: '',
				options: {
					appearanceDirection: 'right',
					position: 'right',
				},
			},
			{
				className: 'dragon_paragraph_3',
				type: 'text',
				text: 'И как-то раз, во время странствия, предстал перед юношей старик, что сидел у дороги и просил милостыню. "Что же с тобой приключилось, дедушка?" - поинтересовался парень и подал в простертую морщинистую руку старика монету. На что старец ответил: "Ох, мальчик мой... Прожил я долгую жизнь, что посвятил я пути героя. Как ты, странствовал я в потемках подземелий, в поисках места, где моей отваге удалось бы себя проявить, да и потратил на это всю жизнь свою. Коли и ты идешь по моему пути, могу лишь дать тебе напутствие — драконы свободолюбивы. Во мраке подземелий тяжело расправить им свои крылья, а если и удается им это, то быстро умирают они, давясь тесными пещерными сводами. Жизнь их будет коротка, а величия своего они никогда не достигнут. Держи же мой меч. Он служил мне верой и правдой, в годы моих странствий, так пусть же теперь послужит и тебе" — с этими словами он протянул герою пояс с ножнами. Юноша принял дар, поклонился и, не говоря ни слова, отправился в то единственное место, где драконам все еще было место.',
				image: '',
				options: {
					appearanceDirection: 'left',
					position: 'left',
				},
			},
			{
				className: 'dragon_paragraph_4',
				type: 'text',
				text: 'Карабкаясь по крутым сводам отвесного ущелья, содрал герой руки, но глаза его смотрели лишь вверх, на все ярче сияющее лазурное небо, лезть до которого, надо было еще целую вечность. Он потерял счет времени и не знал, сколько он карабкался, день или месяц, год или век. И вот, когда руки его были стерты в кровь, а разум его был на грани безумия, достиг он поверхности. Ослепительно желтое солнце окончательно выжгло у него из головы память и лишь преданный клинок все еще напоминал юноше цель его странствий. Остатками своих пальцев, тяжело было юноше совладать с застежкой на ремне, но все же в один момент ножны упали в густую зеленую траву, что быстро похоронила их в себе. Расправив могучие крылья, юноша взмыл в высь и, окатив воздух струей могучего пламени, улетел в даль.',
				image: '',
				options: {
					appearanceDirection: 'right',
					position: 'right',
				},
			},
		],
	},
	{
		preview: {
			title: 'Море',
			description:
				'I see a coconut crab, who swims at your neighbor`s pool at night, who else hold their breth in there?..',
			image: '/src/pics/cards/sea.jpg',
			backImage: '/src/pics/Sea/sea_back.png',
		},
		name: 'Sea',
		link: '/Sea',
		content: [
			{
				className: 'sea__heading',
				type: 'title',
				text: 'Море',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'sea__paragraph__1',
				type: 'text',
				text: 'Жил на свете одно время рыбак. Жил он голодно и не знал в быту своем ничего, кроме ловли рыбы. “Кормит море меня” – говорил он вслух временами – “и вечно я ему за это благодарен”. Постоянный вкус рыбы во рту уже не воспринимался рыбаком как что то необычное, а сеть, кою использовал он в качестве одежды своей, совсем уж казалось приросла к телу его. И счастливо жил рыбак, не боясь утонуть в море, благодаря своей старенькой лодке, что даже в шторм возвращала его на берег с уловом.',
				image: '',
				options: {
					appearanceDirection: 'right',
					position: 'right',
				},
			},
			{
				className: 'fish',
				type: 'image',
				text: '',
				image: 'src/pics/Sea/fish.png',
				options: {
					appearanceDirection: 'left',
					position: 'left',
				},
			},
			{
				className: 'paragraph2',
				type: 'text',
				text: 'И вот в одно утро снова он отвязал свою лодку от колышка, торчащего из песка, и отправился по ставшему привычным за многие годы маршруту, ставить сети. За кропотливой работой не замечал он, как солнце уже достигло зенита в вечном танце своем. Вытирая пот со лба, присел он отдохнуть, не заметив, как сон еще более умело расставил во круг него сети свои.',
				image: '',
				options: {
					appearanceDirection: 'left',
					position: 'left',
				},
			},
			{
				className: 'paragraph3',
				type: 'text',
				text: 'Проснувшись от холода, понял рыбак ошибку свою, и что наступила уже глубокая ночь. Взявшись руками, представляющими из себя причудливый узор из костей и сухожилий, за весла, погреб он к берегу, видневшемуся вдалеке. Как вдруг ударилось что-то о лодку. Выглянув в кромешную тьму, увидел несчастный два красных глаза, пронзающих водную тьму и пристально смотрящих на него. Был то хозяин мест этих, лишь его взгляд сиял в самой душе людской. Рыбак многое прочитал в этих светилах. И боль, и азарт, и саму смерть, что манила всякого, кто узрел однажды ее истинный облик.',
				image: '',
				options: {
					appearanceDirection: 'right',
					position: 'right',
				},
			},
			{
				className: 'eyes',
				type: 'image',
				text: '',
				image: 'src/pics/Sea/eyes.gif',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'paragraph4',
				type: 'text',
				text: 'Улыбка заиграла на лице, давно позабывшем эту гримасу. Желание обуздать владыку тех мест, на коих держится сама суть его жизни пересилила манящий в далеке огонек ставшего родным дома. Однако, как бы долго не гнался за хозяином морей рыбак, не мог он догнать взгляд полный ехидства и задора, до тех пор, пока и вовсе не растворились глаза в пучине морской. И тогда услышал он голос глаз тех, медленно стихающий под завыванием ветра и шумом моря – “Море не простит тебе ошибку, допущенную однажды, забыл ты о нити своей, что порвалась по пути. Теперь участь твоя – вечное плавание в темноте”.',
				image: '',
				options: {
					appearanceDirection: 'left',
					position: 'left',
				},
			},
			{
				className: 'paragraph5',
				type: 'text',
				text: 'Ноги замерзли от ночных вод, а руки устали от работы, огонек дома, являвшийся последним маяком, и вовсе пропал из виду, а лодка, что так долго служила спасением от морских пучин, тихо поскрипывала, терпя редкие удары волн, будучи забытой на далеком берегу.',
				image: '',
				options: {
					appearanceDirection: 'right',
					position: 'right',
				},
			},
			{
				className: 'boat',
				type: 'image',
				text: '',
				image: 'src/pics/Sea/boat.png',
				options: {
					appearanceDirection: 'left',
					position: 'left',
				},
			},
		],
	},
	{
		preview: {
			title: 'Пустошь',
			description:
				'Кто сражается с чудовищами, тому следует остерегаться, чтобы самому при этом не стать чудовищем. И если ты долго смотришь в бездну, то бездна тоже смотрит в тебя.',
			image: '/src/pics/cards/wastes.jpg',
			backImage: '/src/pics/Waste/waste.png',
		},
		name: 'Waste',
		link: '/Waste',
		content: [
			{
				className: 'waste__heading',
				type: 'title',
				text: 'Пустошь',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__1',
				type: 'text',
				text: 'Тысячи лет назад была на свете деревня, луга ее были богаты сочной травой, а леса, что простирались по одну сторону от нее, плодоносили круглый год, предлагая путнику разнообразные фрукты, что свисали с их ветвей. Но была одна деталь, которая нарушал это идиллию. По другую сторону от деревни располагалась бескрайняя пустошь. На сколько хватало взгляда, уходила она далеко за горизонт. Казалось, что даже солнце в ней превращалось из доброго друга, что всегда готов помочь, в хладнокровного убийцу, что жаром своим так и норовит погубить забредшего туда путника. Селяне боялись пустоши и рассказывали истории о страшных тварях, что обитают там. Говорили, что нет у них ни жалости, ни разума. И даже глаз лишены они, в угоду своему хищническому обонянию.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__2',
				type: 'text',
				text: 'Но как-то раз, забрел в эту деревню странствующий рыцарь. Но к какому бы дому он ни подходил, везде его встречали лишь холодные взгляды. Не было никому дела до странника. И долго бы еще скитался так герой, если бы не приметил его деревенский староста.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__3',
				type: 'text',
				text: '-Вижу, что из далека ты путь держишь — сказал глава поселения, подойдя ближе — пойдем же в мой дом, я дам тебе еды и воды, чтобы мог ты дальше продолжать дорогу свою.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__4',
				type: 'text',
				text: 'Пройдя вдоль улицы к дому, где жил староста, тот удалился внутрь и вскоре вернулся с куском хлеба и стаканом воды. За что путник его поблагодарил и спросил, что же находится в пустоши, что простирается дальше деревни. "Поганое это место." — ответил староста — "Не найдешь ты там ничего людского. Живут там твари всякие. Кроме смерти не найдешь ты там иной судьбы.". Но любопытство рыцаря было сильнее страха перед тварями, которых за свою жизнь он повидал немало.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__5',
				type: 'text',
				text: 'В сумерках сменилась земля под ногами путника с плодородной на выжженную солнцем. Сколько бы он ни шел, пейзаж оставался неизменным. Лишь причудливый узор, образованный трещинами на земле, стремился разнообразить общую картину.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__6',
				type: 'text',
				text: 'Наконец, сумерки сменились кромешной тьмой. На сколько жаркими были в пустоши дни, на столько же холодными были в ней ночи. Постелив наземь свой плащ, путник позволил себе задремать. Однако не долгим был его сон. Посреди грёз почувствовал он на себе чужой взгляд. Еще не успев разомкнуть глаз, привычным движением достал герой из ножен свой меч. И лишь затем увидал фигуру, что примостилась в двух метрах от него. Сгорбившись, она стояла и рассматривала землю подле своих ног, но чувствовал рыцарь, что существо это устремило свой взор к нему. И хотя не видно было ему глаз противника, но чувствовал он, какой жалостью и каким презрением был пропитан этот взгляд. И вот, уже незваный гость оголил оружие.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__7',
				type: 'text',
				text: 'Говорят, что лишь внешне пустошь кажется вымершей. Старики рассказывают, что если сидеть очень тихо, то выйдут истинные обитатели этих мест и услышишь ты, как поют они свои песни, что не предназначены для солнца. Почувствуешь ты топот множества пляшущих ног, отвергнутых грубостью земли. Говорят, что это истинный облик человеческий. Не посрамлённый многочисленной порчей крови, что обрекла людей на ужасы жизни на поверхности. На ужасы изгнания из своего родного дома.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__8',
				type: 'text',
				text: 'Взмах... Упала наземь голова. Над мертвым телом склонился победитель. Тверда была рука его и спокоен взор. Закинув за спину свое орудие, растворился он во тьме.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
			{
				className: 'waste__paragraph__9',
				type: 'text',
				text: 'Долго лежало обезглавленное тело посреди равнины. В наступившей тишине, потекла музыка, что доносилась из-под земли, не было в ней ни гармонии, ни ритма. Послышался топот невесомых ног, сливающихся в танце, но не было у ног тех плоти. Очам покойного предстали невероятных размеров залы, наполненные светящимися силуэтами, что звали его к себе, прячась глубоко под землей, в своих вечных и столь недосягаемых дворцах. И лишь коршун, что парил высоко в небе, видел, как в последний раз прыгало в танце обезглавленное тело.',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: 'center',
				},
			},
		],
	},
	{
		preview: {
			title: 'Башня',
			description: 'фыв',
			image: '/src/pics/cards/tower.jpg',
			backImage: '/src/pics/MainPage/layer__bottom.png',
		},
		name: 'Tower',
		link: '/Tower',
		content: [
			{
				className: '',
				type: '',
				text: 'testTitle',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: '',
				},
			},
		],
	},
	{
		preview: {
			title: 'Статуя',
			description: 'фыв',
			image: '/src/pics/cards/statue.jpg',
			backImage: '/src/pics/MainPage/layer__bottom.png',
		},
		name: 'Statue',
		link: '/Statue',
		content: [
			{
				className: '',
				type: '',
				text: 'testTitle',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: '',
				},
			},
		],
	},
	{
		preview: {
			title: 'Герой',
			description: 'фыв',
			image: '/src/pics/cards/hero.jpg',
			backImage: '/src/pics/MainPage/layer__bottom.png',
		},
		name: 'Hero',
		link: '/Hero',
		content: [
			{
				className: '',
				type: '',
				text: 'testTitle',
				image: '',
				options: {
					appearanceDirection: 'top',
					position: '',
				},
			},
		],
	},
];

export default tales;
