import { FC } from 'react';
import './Pan.scss';

const Pan: FC = () => {
	const text = `Когда то давным давно жил в деревушке на окраине королевства юноша. Каждую ночь в тайне от родителей своих бросал он из окна наземь веревку и уходил в лес, где проводил время со своей возлюбленной, до рассвета рассматривая звезды. Небо, что открывалось влюбленным, было подобно длани бога, что каждую ночь рассыпает бисер на небесный свод, каждый раз придавая тому новые очертания и рисуя новые узоры.
	-Хотела бы я стать одной из тех звезд. - как то раз нарушила тишину девушка - Хотела бы я, словно ангел хранитель, вести заблудших путников, что слишком углубились в ночной лес, домой. Хотела бы подобно компасу направлять моряков к земле, давая тем надежду на тихую гавань...
	-От чего же у тебя такие мысли? - выходя из полудрёмы, пробормотал юноша - чем же тебе не нравится та жизнь, которую мы с тобой проживаем прямо сейчас?
	-Мне всё нравится. - слегка смутилась девушка - Однако жить, осознавая, что видимся мы с тобой лишь ночью тайком от родителей, как бы пряча свою истинную личину, не приносит более мне счастья. Не чувствую я, что эта жизнь - это действительно то, чего хочет душа моя, к чему стремится сердце моё. Лёжа здесь, под раскидистым дубом, сквозь ветви которого пробивается звездный свет, душа моя, словно пробиваясь сквозь дебри сознания моего, светит мне тускллым сиянием, пытаясь направить меня на новый путь, что предначертан мне задолго до рождения.
	Юноша задумался, не зная, что ответить на такое высказывание.
	-К чему ты начала эту беседу? Мысли твои настолько же мне непонятны, на сколько пугают  меня. Ведь, если задуматься, призывают они наши пути разойтись на дороге жизни.
	-Так и есть - с болью и решимостью произнесла девушка. - любовь наша священна, однако жизнь на ней не заканчивается. Больно мне говорить это, однако сегодняшняя встреча станет для нас последней. Люблю я тебя всем своим сердцем и от того отпускаю, ибо, коль мы продолжим то, что имеем, в один момент кто то из нас станет несчастен, чего я хочу меньше всего в этой жизни. Пускай я и уйду, но идея моя будет вечно с тобой. Вечно я буду направлять тебя, вечно образ мой будет помогать тебе в трудную минуту и силуэт, что порой проскочет на краю сноведения пред взором твоим поможет тебе в трудную минуту. Как бы больно нам не было, но это та истина, к которой я пришла...
	Долгие годы жил юноша в ненависти. Печаль, что так долго затмевала его разум, перегнивала в злость от беспомощности и отчаянья по столь трагичной потере. Но жизнь продолжалась. Уйдя в скитания и поиск абстрактной истины, юноша провел долгие годы. Скитаясь из страны в страну, от мудреца к мудрецу, пытался за десятилетия постичь он ту простую истину, к которой однажды смогла придти совсем юная девушка. К той истине, наличие которой стало катализатором его беспомощных блужданий. 
		Под иссохший дуб тихо проскользнул силуэт. Оперев трость о некогда могучее древо, улегся он в густую траву. Ныне более не заслоняла листва сияние вечных светил. Гладя на их россыпь, что осталась единственным напоминанием о том, что мир не умер до конца, задремал старец.
		Щебетали ночные птицы. От их пения открылись глаза юноши. В своих руках увидел он чистый пергамент и перо. Расположившись поудобнее, он начал писать: "Здравствуй, дорогая моя! Много лет хотел я написать тебе, но душевные терзания из раза в раз отнимали перо у рук моих. Признать по правде, долго не мог понять я порывов твоих, из раза в раз принимая их на личный счет, однако звезда, что привела меня сюда вновь, показала мне невежество моё и слепоту мою. Вечно ты светила мне в окно, освещяя стол долгими ночами и выводя меня из леса, когда надежда уже была утеряна, был то густейший из лесов, имя которому - разум. Напрвляла ты меня в тихую гавань во время шторма. Был то сверепейший из штормов, имя которому - отчаянье. Долго не мог понять я смысла слов твоих, однако сейчас пишу тебе в надежде на то, что сможем мы еще увидится. И сейчас я смогу сказать тебе то, что так и не смог сказать много лет назад. Сейчас я нахожусь под тем дубом, где мы проводили бесчетные ночи. И знаешь, сейчас я понимаю, что место это волшебное. Само оно прекрасно, а ночи здесь и вправду бесконечные. С любовью, Пан". Сложив письмо в причудливую фигуру, юноша отправил его в полёт. Ветер подхватил его и унес прямо на встречу сияющей во мраке звезде.
		Мальчик встал. последний раз оглядев поляну, взгляд его замер. "Чуть было не проглядел" - промелькнуло у него в голове. Он улыбнулся.
	-Здравствуй! - он пошёл навстречу.`;
	const ps =
		'Поздравляю, ты прошел весь этот путь, который, честно сказать, не знаю, зачем начинал. У всех нас великое множество своих тараканов, прятать которых каждый учится самостоятельно, в меру своего жизненного опыта. С полным перечнем моих ты ознакомился, посему хочется надеяться, что на те же самые грабли ступать тебе будет проще, чем в свое время довелось мне. Живи и радуйся жизни! Она не столь длинна, чтобы распыляться на такого рода мелочи, надеюсь, что у тебя все будет хорошо!';
	const pps =
		'Спасибо вам всем за это прекрасное приключение. Пускай оно и было наполнено болью, но лишь через нее мы можем почувствовать истенное счастье! Очень жаль, что многие вещи нам становятся ясны слишком поздно, однако я уверен, что пересекшись однажды, пути наши все еще способны найти общую развилку. Спасибо, パン';
	return (
		<div className="panPage">
			<div className="panPage__container" />
			<div className="panPage__tale">
				<div className="panPage__tale__title">Отголосок</div>
				<div className="panPage__tale__text">{text}</div>
				<div className="panPage__tale__ps">{ps}</div>
				<div className="panPage__tale__pps">{pps}</div>
			</div>
		</div>
	);
};

export default Pan;
